import Component from '../component.js';

class Card extends Component {
    render() {
        return new Promise(resolve => {
            resolve(`
            <div class="wrapper-card">
            <div class="card-title">
                <h1>Візітная картка</h1>
            </div>
            <div class="card-info">
                <div class="card-info__photo">
                    <img src="../../../img/card/изображение_viber_2024-01-22_21-48-30-107.jpg" alt="">
                </div>
                <div class="card-info__title">
                    <p><span>Кіраўнік музея:</span> Траян Іна Мікалаеўна</p>
                    <p><span>Дата стварэння</span> – <br>7 красавіка 2010 г.</p>
                    <p><span>Агульная плошча:</span> 18 м2.</p>
                    <p><span>Агульная колькасць экспанатаў:</span> 190.</p>
                </div>
            </div>
            <div class="card-text">
                <h2>Добры дзень, паважаныя наведвальнікі</h3>
                <h3>Мы вітаем вас у Музеі беларускага ручніка Дзяржаўнай установы адукацыі “Лазавіцкая сярэдняя школа Клецкага раёна”, бо кожны, хто любіць сваю Радзіму, павінен ведаць не толькі яе сучаснасную гісторыю, але і мінулае.
                    Музей існуе з 2010 г.</h3>
                <h3>Асноўныя накірункі дзейнасці:</h3>  
                <p>-  адукацыйна-выхаваўчы;<br>
                -  навукова-даследчы;<br>
                - экскурсійна-выставачны.<br>
                </p>
                <h3>Актыў і савет музея займаюцца:</h3> 
                <p>- зборам і захаваннем музейных прадметаў;<br>
                - арганізацыяй і афармленнем выстаў;<br>
                - распрацоўкай і правядзеннем экскурсій і іншых мерапрыемстваў;<br>
                -  удзелам у конкурсах, акцыях, навукова-даследчых канферэнцыях.<br> </p>
                <h3>Кароткая характарыстыка музейных фондаў.</h3>
                <p>На 1 студзеня 2024 г. музейны фонд складае 190 музейных прадметаў: 
                    асноўны фонд - 155 (унікальныя тканыя і вышываныя ручнікі, посцілкі, дываны, сурвэткі, пакрышкі, рагавічкі - сапраўдныя шэдэўры ткацтва і вышыўкі; кросны, прасніца, сукала ручное і нажное, церніца, верацёны, грэбні, трапала, бёрда, матавіла і іншыя прадметы нашых аднавяскоўцаў для апроўкі ільну і ткацтва),  дапаможны - 35.</p>
                
                <h3>Найбольш каштоўныя музейныя прадметы:</h3>
                <p>Тканы ручнік з птушкамі, павернутымі дзюбамі ў розныя бакі (1920-я г.г.); рушнікі ХІХ – пач. ХХ ст., калаўрот (сукала нажное) (1930-я г.г.), прасніца (1920-я г.г.), сукала ручное (1920-я г.г.), церніца (1930-я г.г.), бёрда (1920-я г.г.), кросны (1920-я г.г.), адзенне жыхароў нашай мясцовасці (жаночыя сарочкі і спадніца) (1920-я г.г.).</p>
                <h3>Прывабнасць музея:</h3>
                <ol>
                    <li> Яго месцазнаходжанне – у 2-х кіламетровай адлегласці ад мяжы 
                        паводле Рыжскага мірнага дагаровору, таму і музейныя рэчы вельмі цікавыя, бо належалі людзям розных нацыянальнасцей - палякам, беларусам, рускім, украінцам. Акрамя таго, увасобілі ў сабе элементы розных рэгіёнаў Беларусі – Клеччыны, Капыльшчыны, Случчыны, Панямоння, Палесся. </li>
                    <li>Пошукавыя экспедыцыі актывістаў музея сабралі ўнікальныя 
                        прадметы ткацтва і вышыўкі – 155 экспанатаў, якія распавядаюць наведвальнікам не толькі аб працэсе вырошчвання лёну і яго апрацоўцы, але і паказваюць наколькі таленавіты беларускі народ і багата яго спадчына. </li>
                    <li>Правядзенне з наведвальнікамі віртуальных падарожжаў, 
                        інтэрактыўных экскурсій, майстар-класаў, наяўнасць фотазоны.</li>
                    <li>Пасля наведвання музея можна пабываць у гістарычных месцах 
                        нашага рэгіёна – былы маёнтак Вайніловічаў і мяжа падзелу тэрыторыі Беларусі паводле дагавора 1921 г.</li>
                </ol>
                <h3> Адметныя асаблівасці:</h3>
                <p>-  захаванне і развіццё традыцый двухнітовага ткацтва, вышыўкі, 
                    рукадзелля і цеснае супрацоўніцтва з мясцовымі майстрыхамі; <br>
                    -  сувязь музейнай дзейнасці з турыстычнай;<br>
                    -  музейныя рэчы, атрыманыя падчас этнавандровак;<br> – матэрыял для    
                    напісання навукова-даследчых работ па гісторыі малой Радзімы; <br>
                    -  супрацоўніцтва з работнікамі Нацыянальнага гістарычнага архіва 
                    РБ, навуковымі супрацоўнікамі ДУ “Нацыянальны Мастацкі Музея РБ” і ДУ “Музей гісторыі Клеччыны”.</p>
                <h3> Найбольш цікавыя экскурсіі:</h3>
                <p>"Музей  у  чамадане”, “Ручнік  ў народных святах беларусаў”, “Сучаснае жыццё беларускага ручніка”, “Чытаем узоры-сімвалы”, “Нястрачаная спадчына”, “Музейны калейдаскоп”, “Таямнічы ручнік”, “Рэчы сялянскага побыту”,  “Скарбонка мінулага”, “Нам засталася спадчына”,  “Лазавіцкі народны касцюм”.</p>
                <h2>Запрашаем усіх нераўнадушных да далейшага развіцця музея.</h2>
                </div>
                <div class="img-card"><img src="../../../img/МУЗЕЯ.jpg" alt=""></div>
        </div>  
            `);
        });
    }
}

export default Card;