import Component from '../component.js';

class Document extends Component {
    render() {
        return new Promise(resolve => {
            resolve(`
            <div class="wrapper-document">
    <div class="document-title">
        <h1>Дакументацыя</h1>
    </div>
    <div class="document-link">
        <ol type="1">
            <li><a href="https://pravo.by/document/?guid=12551&p0=Hk1600413"  target="_blank">Кодэкс Рэспублікі Беларусь аб культуры (20 ліпеня 2016 г. № 413-З)</a></li>
            <li><a href="../../../document/методические рекомендации по организации деятельности музеев учреждений образования.pdf"  target="_blank">Метадычныя рэкамендацыі аб арганізацыі дзейнасці музеяў устаноў адукацыі Рэспублікі Беларусь</a></li>
            <li><a href="https://etalonline.by/document/?regnum=W20820022"  target="_blank">Аб зацвярджэннi iнструкцыi аб парадку ўлiку i iнвентарызацыi каштоўнасцей культурна-гiстарычнага фонду, якiя знаходзяцца ў падначаленых мiнiстэрству культуры арганiзацыях, а таксама ў структурных падраздзяленнях мясцовых выканаўчых i распарадчых органаў, якiя ажыццяўляюць дзяржаўна-ўласныя паўнамоцтвы ў галiне культуры, i падначаленых iм арганiзацыях</a></li>
            <li><a href="../../../document/postanovlenieno383.pdf"  target="_blank">Об утверждении Правил размещения оружия, его составных частей и компонентов, боеприпасов при осуществлении деятельности, связанной со служебным и гражданским оружием и боеприпасами к нему, коллекционированием и экспонированием оружия и боеприпасов и признании утратившими силу некоторых постановлений и структурного элемента постановления Министерства внутренних дел Республики Беларусь</a></li>
            <li><a href="../../../document/2004-57(084-103).pdf"  target="_blank">Постановление министерства финансов Республики Беларусь (15 марта 2004 г. N 34)</a></li>
        </ol>
    </div>
</div>
                
            `);
        });
    }
}

export default Document;