import Component from '../component.js';

class Suitcase extends Component {
    render() {
        return new Promise(resolve => {
            resolve(`
            <div class="wrapper-suitcase">
    <div class="suitcase-title">
        <h1>Музей ў чамадане</h1>
    </div>
    <div class="suitcase-text">
        <p>Вас вітае Лазавіцкая сярэдняя школа Клецкага раёна! Мы прадстаўляем “Музей у плеценым чамадане” пад назвай “Ручнік – верны спадарожнік чалавека” і гэта не выпадкава – у нашай установе адукацыі існуе Музей беларускага ручніка, які налічвае 190 экспанатаў, большасць з якіх атрымана падчас этнавандровак.</p>
        <p>Сюды ўмясцілася толькі малая толіка тых дзіўных рэчаў, якія вы можаце пабачыць у музеі. Аднак і тут знайшлося месца сапраўдным шэдэўрам таленту і творчасці маіх землякоў. </p>
        <p>Сыравінай для ткацтва ў нашай мясцовасці здаўна служыў лён. Для яго апрацоўкі існавала шмат спосабаў і прылад, назаву некаторыя. Лён рвалі, вязалі ў снапы, малацілі пранікам. Для змягчэння саломкі яго расцілалі на расу на 3 – 6 тыдняў, затым сушылі, мялі церніцай і трапалі траплом. Пасля часалі: з канца 19 стагоддзя выкарыстоўвалі грэбні з металічнымі зубамі.</p>
        <p>
            Для прадзення карысталіся прасніцай, да 19 ст. верацяном, а  пазней калаўротам. Звівалі пражу ў маткі матавілам.
            З 19 ст. для нашай мясцовасці характэрна снаванне на рухомай сноўніцы. Ткацкі станок мае аднавяскоўцы называлі кросны. Ткалі палотны з лѐну і воўны, а з канца 19 ст.  з’яўляюцца змешаныя тканіны.
        </p> 
        <p>
            Для пашыву адзення карысталіся тканінамі натуральнага колеру лёну і фарбавалі натуральнымі фарбавальнікамі.
            Ткалі ў нашай мясцовасці розныя вырабы, але верным спадарожнікам здаўна быў ручнік. Нашы экспанаты адносяцца да 19 – пач 20 ст.
        </p>
        <p>Звярніце ўвагу – якая прыгажосць і дасканаласць! Шырокае распаўсюджанне ў нас атрымалі тканыя ручнікі паўсядзѐннага, абрадавага і дэкаратыўнага прызначэння. Яны выконваліся ў тэхніцы аднаўточнага бранага, двухуточнага чатырохнітовага і шматнітовага ткацтва, двухбаковым пераборам. Іх вызначае самастойны дэкор, багацце дробнаўзорыстай тэкстыльнай фактуры і перапляценняў. Пераважае “вясёлка” - жоўты, чырвоны, сіні, блакітны і іншыя колеры. Выгляд завершанасці надаюць вязаныя кручком карункі на канцах. Вытканыя ручнікі часта ўпрыгожвалі вышыўкай або чырвонаю атласнаю лентаю.</p>  
       <p> У паўсядзѐнным карыстанні ўжываліся ручнікі, якія не вылучаліся багаццем упрыгожанняў і тэхнікай выканання: для выцірання твару і рук - «уціральнік», або выцірання   і пераносу посуду з ежай на жніво - «трапкач». </p>
        <p>Больш вузкія па шырыні, не надта доўгія, прыгожыя і амаль цалкам затканыя былі радзінныя ручнікі: традыцыйная чырвань аднаколернага аздаблення, папярэчна-паласаты ўзор. </p>
       <p> Без ручніка не абыходзіўся ніводны этап вяселля. Звярніце ўвагу: пераважае чырона-белы і блакітны колер. Абавязкова павінны быць вышытыя птушкі, павернутыя дзюбамі адзін к аднаму, узоры сям’і, кахання і жыцця. </p>
       <p> Шырока выкарыстоўваўся ручнік і ў жалобнай абраднасці. Напрыклад, калі памірала дзяўчына, яе апраналі ў вянчальны строй і давалі некалькі ручнікоў. Доўгі час існаваў звычай абіваць дамавіну двума – трыма ручнікамі, клалі на дно вышываны ручнік. І сёння труну апускаюць на ручніках.</p>
       <p> Канешне, найпрыгажэйшыя сярод ручнікоў – набожнікі. Прынята, каб штодня ручнік вісеў на абразах: у буднія дні – больш сціплыя; тыдням Вялікага посту адпавядала чорнае ўкрапленне, а на свята покуць убіралі самымі прыгожымі, з перавагаю чырвонага колеру, ручнікамі.</p>
        <p>
            Ручнік-абыдзеннік ткаўся за адзін дзень, ці ноч, падчас засухі, ці другога ліха. 
            Узоры традыцыйных беларускіх ручнікоў працягваюць жыць і ў вырабах сучасных майстрых нашай мясцовасці.
        </p>
        <p>Можна бясконца гаварыць пра ручнікі, бо пакуль побач з чалавекам жыве пачуццё прыгожага, імкненне да сапраўднага, будзе жыць і ручнік. Завітайце ў наш музей, і пабачыце майстэрства і мастацкі густ маіх землякоў і адчуеце сапраўднае душэўнае задавальненне, бо колькі цікавага, нават таямнічага хавае ў сабе гэтая незвычайная рэч!!! </p>
       <p> Дзякуй за ўвагу, чакаем Вас у нашым музеі!</p>
    </div>
</div>       
            `);
        });
    }
}

export default Suitcase;